app/views/games/index.html.erb

-->
<% test = @name_options = Member.all.reject{|m| m == @random_member}.map{|m| m}.sample(3) << @random_member %>
---
SELECT "members".* FROM "members" ORDER BY "members"."id" ASC LIMIT 1