app/views/identities/new.html.erb

  <%= f.label :member_id %>
  <%= f.collection_select(:member_id, Member.all, :id, :email, {include_blank: true} ) %>
---
SELECT "members".* FROM "members"

  <%= f.label :identity_type_id %>
  <%= f.collection_select(:identity_type_id, IdentityType.all, :id, :identity_kind, {include_blank: true} ) %>
---
SELECT "identity_types".* FROM "identity_types"