app/controllers/games_controller.rb

  def index
    correct_guess = Member.find(session[:correct_guess_id]) if session[:correct_guess_id]
---
SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT 1  [["id", "rand(1..Member.all.length)"]]