app/controllers/identities_controller.rb

  def create
    @identity = Identity.new(identity_params)
    if @identity.save
---
INSERT INTO "identities" ("created_at", "identity_type_id", "member_id", "updated_at", "value") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 13 Jan 2014 21:04:40 UTC +00:00], ["identity_type_id", 1], ["member_id", 2], ["updated_at", Mon, 13 Jan 2014 21:04:40 UTC +00:00], ["value", "http://github.com/avallabh"]]