app/controllers/members_controller.rb

INSERT INTO "members" ("created_at", "email", "first_name", "gender", "last_name", "photo_url", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @member = Member.new(member_params)

    if @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @member = Member.find(params[:id])