app/controllers/sessions_controller.rb

  def create
# gets the hash of ALL INFO
#    raise request.env["omniauth.auth"].to_yaml
    auth = request.env["omniauth.auth"]
    user = User.find_or_create_by(provider: auth["provider"], uid: auth["uid"]) #|| User.create_with_omniauth(auth)
---
SELECT "users".* FROM "users" WHERE "users"."provider" = 'github' AND "users"."uid" = '5490993' LIMIT 1